# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 5 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8s.yaml' will call yolov8.yaml with scale 's'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
scale: s

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  # RGB
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] #2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8

  # IR
  - [-4, 1, Conv, [64, 3, 2]] # 4 3
  - [-1, 1, Conv, [128, 3, 2]] # 5
  - [-1, 3, C2f_Faster, [128, True]] # 6
  - [-1, 1, Conv, [256, 3, 2]] # 7

  # Fusion1
  - [-3,1,RIFusion,[64]] #8

  # RGB
  - [-4, 6, C2f, [256, True]] #9 256
  - [-1, 1, Conv, [512, 3, 2]] # 10
 
  # IR
  - [-4, 6, C2f_Faster, [256, True]] # 11
  - [-1, 1, Conv, [512, 3, 2]] # 12
 
  # Fusion2
  - [-3,1,RIFusion,[128]]  #13

  # RGB
  - [-4, 6, C2f, [512, True]] #14
  - [-1, 1, Conv, [1024, 3, 2]] # 15

  # IR
  - [-4, 6, C2f_Faster, [512, True]] #16
  - [-1, 1, Conv, [1024, 3, 2]] # 17

  # Fusion3
  - [-3,1,RIFusion,[256]] #18

  # RGB
  - [-4, 3, C2f, [1024, True]] #19
  - [-1, 1, SPPF, [1024, 5]] # 20

  # IR
  - [-4, 3, C2f_Faster, [1024, True]] #21
  - [-1, 1, SPPF, [1024, 5]] # 22

  
  # 新增：使用 CMASSA 替换原 ADD 融合
  # 作用：在 P3/P4/P5 做 RGB<->IR 双向跨模态稀疏注意力融合，减少无关模态干扰
  # 用法：参数 [reduction, kv_stride, num_heads]，当前 [2,4,1] 表示 1/2 通道、K/V 下采样4倍、单头注意力
  - [[9,11], 1, CMASSA, [2, 4, 1]] # 23
  - [[14,16], 1, CMASSA, [2, 4, 1]] # 24
  - [[20,22],1, CMASSA, [2, 4, 1]] # 25
# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #26
  - [[-1, 24], 1, Concat, [1]] # 27
  - [-1, 3, C2f, [512]] # 28

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #29
  - [[-1, 23], 1, Concat, [1]] # 30
  - [-1, 3, C2f, [256]] # 31

  - [-1, 1, Conv, [256, 3, 2]] #32
  - [[-1, 28], 1, Concat, [1]] # 33
  - [-1, 3, C2f, [512]] # 34

  - [-1, 1, Conv, [512, 3, 2]] # 35
  - [[-1, 25], 1, Concat, [1]] # 36
  - [-1, 3, C2f, [1024]] # 37

  - [[31, 34, 37], 1, OBB, [nc, 1]]
