# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 two-stream OBB with ASSARIFusion and ASSAAdd.

nc: 7
scales:
  #n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]
scale: s

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8

  - [-4, 1, Conv, [64, 3, 2]] # 4
  - [-1, 1, Conv, [128, 3, 2]] # 5
  - [-1, 3, C2f_Faster, [128, True]] # 6
  - [-1, 1, Conv, [256, 3, 2]] # 7

  - [-3, 1, ASSARIFusion, [64, 8, 2, True]] # 8

  - [-4, 6, C2f, [256, True]] # 9
  - [-1, 1, Conv, [512, 3, 2]] # 10
  - [-4, 6, C2f_Faster, [256, True]] # 11
  - [-1, 1, Conv, [512, 3, 2]] # 12

  - [-3, 1, ASSARIFusion, [128, 8, 4, True]] # 13

  - [-4, 6, C2f, [512, True]] # 14
  - [-1, 1, Conv, [1024, 3, 2]] # 15
  - [-4, 6, C2f_Faster, [512, True]] # 16
  - [-1, 1, Conv, [1024, 3, 2]] # 17

  - [-3, 1, ASSARIFusion, [256, 8, 4, True]] # 18

  - [-4, 3, C2f, [1024, True]] # 19
  - [-1, 1, SPPF, [1024, 5]] # 20
  - [-4, 3, C2f_Faster, [1024, True]] # 21
  - [-1, 1, SPPF, [1024, 5]] # 22

  - [[9, 11], 1, ASSAAdd, [8, 2, True]] # 23
  - [[14, 16], 1, ASSAAdd, [8, 4, True]] # 24
  - [[20, 22], 1, ASSAAdd, [8, 4, True]] # 25

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 26
  - [[-1, 24], 1, Concat, [1]] # 27
  - [-1, 3, C2f, [512]] # 28
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 29
  - [[-1, 23], 1, Concat, [1]] # 30
  - [-1, 3, C2f, [256]] # 31
  - [-1, 1, Conv, [256, 3, 2]] # 32
  - [[-1, 28], 1, Concat, [1]] # 33
  - [-1, 3, C2f, [512]] # 34
  - [-1, 1, Conv, [512, 3, 2]] # 35
  - [[-1, 25], 1, Concat, [1]] # 36
  - [-1, 3, C2f, [1024]] # 37
  - [[31, 34, 37], 1, OBB, [nc, 1]]
